controllers/PostController.php

    public function actionIndex()
    {
        $query = Post::find();
        $pages = new Pagination(['totalCount' => $query->count(), 'pageSize' => 6]);
        $posts = $query->offset($pages->offset)->limit($pages->limit)->all();
---
SELECT COUNT(*) FROM `post`
SELECT * FROM `post` LIMIT 6 OFFSET 12

    public function actionView()
    {
        //получаем айди статьи, которую необходимо вывести:
        $id = \Yii::$app->request->get('id');

        //получаем пост из БД по айди:
        $post = Post::findOne($id);
---
SELECT * FROM `post` WHERE `id`='6'

    public function actionPolitic()
    {
        $posts = Post::find()->all();
---
SELECT * FROM `post`

    public function actionEconomy()
    {
        $posts = Post::find()->all();
---
SELECT * FROM `post`

    public function actionScience()
    {
        $posts = Post::find()->all();
---
SELECT * FROM `post`

    public function actionSport()
    {
        $posts = Post::find()->all();
---
SELECT * FROM `post`

    public function actionEducation()
    {
        $posts = Post::find()->all();
---
SELECT * FROM `post`