models/Login.php

SELECT * FROM `user` WHERE `username`='2207@yandex.com'
---
    public function validatePassword($attribute, $params)
    {
        if (!$this->hasErrors())
        {
            //ищем пользователя в базе даннных:
            $user = User::findOne(['username' => $this->username]);

SELECT * FROM `user` WHERE `username`='2207@yandex.com'
---
    public function getUser()
    {
        return User::findOne(['username' => $this->username]);