models/Signup.php

INSERT INTO `user` (`username`, `password`) VALUES ('2207@yandex.com', 'bb0d03aedf17d3014ed22818c328ad33bc134b84')
---
    public function signup()
    {
        $user = new User();
        $user->username = $this->username;
        $user->password = sha1($this->password);
        return $user->save();